app/controllers/orders_controller.rb

SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
---
  def show
    @order = Order.find(params[:id])

SELECT * FROM `orders` WHERE (`orders`.`id` = 57)
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO `orders` (`created_at`, `quantity`, `total_price`, `updated_at`) VALUES('2010-12-16 06:47:59', NULL, NULL, '2010-12-16 06:47:59')
---
  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save

SELECT * FROM `orders` WHERE (`orders`.`id` = 29)
---
  def success
    @order =Order.find(params[:id]);