app/controllers/product_orders_controller.rb

  def create
    @product_order = ProductOrder.new(params[:product_order])

    respond_to do |format|
      if @product_order.save
---
INSERT INTO `product_orders` (`created_at`, `product_id`, `order_id`, `updated_at`) VALUES('2010-12-20 07:34:13', NULL, NULL, '2010-12-20 07:34:13')