app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `price`, `created_at`, `updated_at`) VALUES('rubyonrails', 250, '2010-12-15 11:57:20', '2010-12-15 11:57:20')

  def add_to_cart
    @arr=[]
    @qty = nil
    @total_price = 0
    if things_to_check = params[:to_check]
      things_to_check.each do |item_id, act|
        if act == "yes"
          @arr << item_id
          @total_price += Product.find(item_id).price
        end
      end
    end
    if !@arr.empty?
      @qty=@arr.size
      @new_order = Order.create(:total_price => @total_price, :quantity => @qty)
      if @new_order
        @arr.each do |item|
          ProductOrder.create(:order_id => @new_order.id, :product_id => item)
---
SELECT * FROM `products` WHERE (`products`.`id` IN (3,4))
INSERT INTO `orders` (`created_at`, `quantity`, `total_price`, `updated_at`) VALUES('2010-12-16 04:56:21', 2, 1050, '2010-12-16 04:56:21')
INSERT INTO `product_orders` (`created_at`, `product_id`, `order_id`, `updated_at`) VALUES('2010-12-16 04:58:13', 3, 2, '2010-12-16 04:58:13')